{
  "httpRequest": {
    "path": "/books",
    "method": "GET"
  },
  "httpResponse": {
    "delay": {
      "timeUnit": "milliseconds",
      "value": 200
    },
    "body": {
      "contentType": "json",
      "json" : "[{\"authors\":[{\"id\":1001,\"name\":\"Anghel\",\"surname\":\"Leonard\"}],\"id\":1000,\"title\":\"Spring Boot Persistence Best Practices\",\"isbn\":9781484256251,\"description\":\"This book is a collection of developer code recipes and best practices for persisting data using Spring, particularly Spring Boot. The book is structured around practical recipes, where each recipe discusses a performance case or performance-related case, and almost every recipe has one or more applications. Mainly, when we try to accomplish something (e.g., read some data from the database), there are several approaches to do it, and, in order to choose the best way, you have to know the implied trades-off from a performance perspective. You’ll see that in the end, all these penalties slow down the application. Besides presenting the arguments that favor a certain choice, the application is written in Spring Boot style which is quite different than plain Hibernate. Persistence is an important set of techniques and technologies for accessing and using data, and this book demonstrates that data is mobile regardless of specific applications and contexts. In Java development, persistence is a key factor in enterprise, ecommerce, cloud and other transaction-oriented applications. After reading and using this book, you'll have the fundamentals to apply these persistence solutions into your own mission-critical enterprise Java applications that you build using Spring. What You Will Learn Shape *-to-many associations for best performances Effectively exploit Spring Projections (DTO) Learn best practices for batching inserts, updates and deletes Effectively fetch parent and association in a single SELECT Learn how to inspect Persistent Context content Dissect pagination techniques (offset and keyset) Handle queries, locking, schemas, Hibernate types, and more Who This Book Is For Any Spring and Spring Boot developer that wants to squeeze the persistence layer performances.\",\"imageurl\":\"http://books.google.com/books/content?id=dIvgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1002,\"name\":\"Оукс\",\"surname\":\"Скотт\"}],\"id\":1001,\"title\":\"Эффективный Java. Тюнинг кода на Java 8, 11 и дальше. 2-е межд. издание\",\"isbn\":9785446117574,\"description\":\"Программирование и тестирование обычно принято относить к разным профессиональным сферам. Скотт Оукс — признанный эксперт по языку Java — уверен, что если вы хотите работать с этим языком, то обязаны понимать, как выполняется код в виртуальной машине Java, и знать, какие настройки влияют на производительность. Вы сможете разобраться в производительности приложений Java в контексте как JVM, так и платформы Java, освоите средства, функции и процессы, которые могут повысить производительность в LTS-версиях Java, и познакомитесь с новыми возможностями (такими как предварительная компиляция и экспериментальные сборщики мусора). В этой книге вы: - Узнаете, как платформы и компиляторы Java влияют на производительность. - Разберетесь c механизмом сборки мусора. - Освоите четыре принципа получения наилучших результатов при тестировании производительности. - Научитесь пользоваться JDK и другими инструментами оценки производительности. - Узнаете как настройка и приемы программирования позволяют минимизировать последствия сборки мусора. - Научитесь решать проблемы производительности средствами Java API. - Поймете, как улучшить производительность приложений баз данных Java.\",\"imageurl\":\"http://books.google.com/books/content?id=ZqMjEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1004,\"name\":\"Пайерлс\",\"surname\":\"Тим\"},{\"id\":1006,\"name\":\"Боубер\",\"surname\":\"Джозеф\"},{\"id\":1007,\"name\":\"Холмс\",\"surname\":\"Дэвид\"},{\"id\":1005,\"name\":\"Блох\",\"surname\":\"Джошуа\"},{\"id\":1008,\"name\":\"Ли\",\"surname\":\"Даг\"},{\"id\":1003,\"name\":\"Гетц\",\"surname\":\"Брайан\"}],\"id\":1002,\"title\":\"Java Concurrency на практике\",\"isbn\":9785446113149,\"description\":\"Потоки являются фундаментальной частью платформы Java. Многоядерные процессоры — это обыденная реальность, а эффективное использование параллелизма стало необходимым для создания любого высокопроизводительного приложения. Улучшенная виртуальная машина Java, поддержка высокопроизводительных классов и богатый набор строительных блоков для задач распараллеливания стали в свое время прорывом в разработке параллельных приложений. В «Java Concurrency на практике» сами создатели прорывной технологии объясняют не только принципы работы, но и рассказывают о паттернах проектирования. Легко создать конкурентную программу, которая вроде бы будет работать. Однако разработка, тестирование и отладка многопоточных программ доставляют много проблем. Код перестает работать именно тогда, как это важнее всего: при большой нагрузке. В «Java Concurrency на практике» вы найдете как теорию, так и конкретные методы создания надежных, масштабируемых и поддерживаемых параллельных приложений. Авторы не предлагают перечень API и механизмов параллелизма, они знакомят с правилами проектирования, паттернами и моделями, которые не зависят от версии Java и на протяжении многих лет остаются актуальными и эффективными. Эта книга охватывает следующие темы: - Базовые концепции параллелизма и безопасности потоков - Методы построения и составления многопоточных классов - Использование блоков параллелизма в java.util.concurrent - Оптимизация производительности: что можно делать, а что не стоит и пытаться - Тестирование параллельных программ - Атомарные переменные, неблокирующие алгоритмы и модель памяти Java\",\"imageurl\":\"http://books.google.com/books/content?id=yZnsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1009,\"name\":\"Ричардсон\",\"surname\":\"Крис\"}],\"id\":1003,\"title\":\"Микросервисы. Паттерны разработки и рефакторинга\",\"isbn\":9785446109968,\"description\":\"Если вам давно кажется, что вся разработка и развертывание в вашей компании донельзя замедлились – переходите на микросервисную архитектуру. Она обеспечивает непрерывную разработку, доставку и развертывание приложений любой сложности. Книга, предназначенная для разработчиков и архитекторов из больших корпораций, рассказывает, как проектировать и писать приложения в духе микросервисной архитектуры. Также в ней описано, как делается рефакторинг крупного приложения – и монолит превращается в набор микросервисов. В этой книге  Как (и зачем!) использовать микросервисную архитектуру.  Стратегии декомпозиции сервисов.  Управление транзакциями и шаблоны запросов.  Эффективные стратегии тестирования.  Шаблоны развертывания, включая контейнеры и бессерверные платформы.\",\"imageurl\":\"https://static-sl.insales.ru/images/products/1/4661/227684917/44610996.jpg\"},{\"authors\":[{\"id\":1011,\"name\":\"Фуско\",\"surname\":\"Марио\"},{\"id\":1012,\"name\":\"Майкрофт\",\"surname\":\"Алан\"},{\"id\":1010,\"name\":\"Урма\",\"surname\":\"Рауль-Габриэль\"}],\"id\":1004,\"title\":\"Современный язык Java. Лямбда-выражения, потоки и функциональное программирование\",\"isbn\":9785446109975,\"description\":\"Преимущество современных приложений — в передовых решениях, включающих микросервисы, реактивные архитектуры и потоковую обработку данных. Лямбда-выражения, потоки данных и долгожданная система модулей платформы Java значительно упрощают их реализацию. Пришло время повысить свою квалификацию и встретить любой вызов во всеоружии! Книга поможет вам овладеть новыми возможностями современных дополнений, таких как API Streams и система модулей платформы Java. Откройте для себя новые подходы к конкурентности и узнайте, как концепции функциональности улучшают работу с кодом. В этой книге: • Новые возможности Java. • Потоковые данные и реактивное программирование. • Система модулей платформы Java.\",\"imageurl\":\"http://books.google.com/books/content?id=gOweEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1014,\"name\":\"Illary\",\"surname\":\"Huaylupo\"},{\"id\":1013,\"name\":\"John\",\"surname\":\"Carnell\"}],\"id\":1005,\"title\":\"Spring Microservices in Action, Second Edition\",\"isbn\":9781617296956,\"description\":\"Spring Microservices in Action, Second Edition teaches you to build microservice-based applications using Java and Spring. Summary By dividing large applications into separate self-contained units, Microservices are a great step toward reducing complexity and increasing flexibility. Spring Microservices in Action, Second Edition teaches you how to build microservice-based applications using Java and the Spring platform. This second edition is fully updated for the latest version of Spring, with expanded coverage of API routing with Spring Cloud Gateway, logging with the ELK stack, metrics with Prometheus and Grafana, security with the Hashicorp Vault, and modern deployment practices with Kubernetes and Istio. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the technology Building and deploying microservices can be easy in Spring! Libraries like Spring Boot, Spring Cloud, and Spring Cloud Gateway reduce the boilerplate code in REST-based services. They provide an effective toolbox to get your microservices up and running on both public and private clouds. About the book Spring Microservices in Action, Second Edition teaches you to build microservice-based applications using Java and Spring. You’ll start by creating basic services, then move to efficient logging and monitoring. Learn to refactor Java applications with Spring’s intuitive tooling, and master API management with Spring Cloud Gateway. You’ll even deploy Spring Cloud applications with AWS and Kubernetes. What's inside Microservice design principles and best practices Configuration with Spring Cloud Config and Hashicorp Vault Client-side resiliency with Resilience4j, and Spring Cloud Load Balancer Metrics monitoring with Prometheus and Grafana Distributed tracing with Spring Cloud Sleuth, Zipkin, and ELK Stack About the reader For experienced Java and Spring developers. About the author John Carnell is a senior cloud engineer with 20 years of Java experience. Illary Huaylupo Sánchez is a software engineer with over 13 years of experience. Table of Contents 1 Welcome to the cloud, Spring 2 Exploring the microservices world with Spring Cloud 3 Building microservices with Spring Boot 4 Welcome to Docker 5 Controlling your configuration with the Spring Cloud Configuration Server 6 On service discovery 7 When bad things happen: Resiliency patterns with Spring Cloud and Resilience4j 8 Service routing with Spring Cloud Gateway 9 Securing your microservices 10 Event-driven architecture with Spring Cloud Stream 11 Distributed tracing with Spring Cloud Sleuth and Zipkin 12 Deploying your microservices\",\"imageurl\":\"http://books.google.com/books/content?id=_qUuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1017,\"name\":\"Нархид\",\"surname\":\"Ния\"},{\"id\":1018,\"name\":\"Шапира\",\"surname\":\"Гвен\"},{\"id\":1019,\"name\":\"Палино\",\"surname\":\"Тодд\"}],\"id\":1007,\"title\":\"Apache Kafka. Потоковая обработка и анализ данных\",\"isbn\":9785446105755,\"description\":\"При работе любого enterprise-приложения образуются данные: это файлы логов, метрики, информация об активности пользователей, исходящие сообщения и т.п. Правильные манипуляции над всеми этими данными не менее важны, чем сами данные. Если вы – архитектор, разработчик или выпускающий инженер, желающий решать подобные проблемы, но вы пока не знакомы с Apache Kafka, то именно из этой замечательной книги вы узнаете, как работать с этой свободной потоковой платформой, позволяющей обрабатывать очереди данных в реальном времени.\",\"imageurl\":\"http://books.google.com/books/content?id=6uNmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1020,\"name\":\"Копец\",\"surname\":\"Дэвид\"}],\"id\":1008,\"title\":\"Классические задачи Computer Science на языке Java\",\"isbn\":9785446139118,\"description\":\"Cтолкнулись с «неразрешимой» проблемой при разработке программного обеспечения? Скорее всего, кто-то уже справился с этой задачей, и вы можете не ломать голову. Дэвид Копец собрал наиболее полезные готовые решения, принципы и алгоритмы. «Классические задачи Computer Science на языке Java» — это мастер-класс по программированию, содержащий 55 практических примеров, затрагивающих самые актуальные темы: базовые алгоритмы, ограничения, искусственный интеллект и многое другое. В этой книге: - Рекурсия, мемоизация и битовые манипуляции. - Поисковые, графовые и генетические алгоритмы. - Проблемы ограничений. - Кластеризация методом k-среднего, нейронные сети и состязательный поиск.\",\"imageurl\":\"http://books.google.com/books/content?id=DrtLEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1021,\"name\":\"Гутьеррес\",\"surname\":\"Фелипе\"}],\"id\":1009,\"title\":\"Spring Boot 2: лучшие практики для профессионалов\",\"isbn\":9785446115877,\"description\":\"Хотите повысить свою эффективность в разработке корпоративных и облачных Java-приложений? Увеличьте скорость и простоту разработки микросервисов и сложных приложений, избавившись от забот по конфигурации Spring. Используйте Spring Boot 2 и такие инструменты фреймворка Spring 5, как WebFlux, Security, Actuator, а также фреймворк Micrometer, предоставляющий новый способ сбора метрик. В этой кнге: настройка и использование Spring Boot 2; работа с нефункциональными требованиями с помощью Spring Boot Actuator; разработка веб-приложений с помощью Spring Boot 2; постоянное хранение данных с использованием JDBC, JPA и баз данных NoSQL; обмен сообщениями с помощью JMS, RabbitMQ и WebSockets; краткое знакомство с проектами Spring Cloud; тестирование, микросервисы и развертывание в облачной среде с использованием Spring Boot 2; расширение Spring Boot путем создания своего собственного «стартового набора» и добавления функциональности @Enable.\",\"imageurl\":\"http://books.google.com/books/content?id=Bib6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1022,\"name\":\"Мартин\",\"surname\":\"Клеппман\"}],\"id\":1010,\"title\":\"Высоконагруженные приложения. Программирование, масштабирование, поддержка\",\"isbn\":9785446105120,\"description\":\"В этой книге вы найдете ключевые принципы, алгоритмы и компромиссы, без которых не обойтись при разработке высоконагруженных систем для работы с данными. Материал рассматривается на примере внутреннего устройства популярных программных пакетов и фреймворков. В книге три основные части, посвященные, прежде всего, теоретическим аспектам работы с распределенными системами и базами данных. От читателя требуются базовые знания SQL и принципов работы баз данных.\",\"imageurl\":\"http://books.google.com/books/content?id=ehpKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1023,\"name\":\"Лакман\",\"surname\":\"Макдауэлл\"}],\"id\":1011,\"title\":\"Карьера программиста. 6-е издание\",\"isbn\":9785446118397,\"description\":\"Очередное собеседование обернулось разочарованием... в очередной раз. Никто из десяти кандидатов не получил работу. Может быть, «экзаменаторы» были слишком строги? Увы, для поступления на работу в ведущую IT-компанию академического образования недостаточно. Учебники — это замечательно, но они не помогут вам пройти собеседование, для этого нужно готовиться на реальных вопросах. Нужно решать реальные задачи и изучать встречающиеся закономерности. Главное — разработка новых алгоритмов, а не запоминание существующих задач. «Карьера программиста» основана на опыте практического участия автора во множестве собеседований, проводимых лучшими компаниями. Это квинтэссенция сотен интервью со множеством кандидатов, результат ответов на тысячи вопросов, задаваемых кандидатами и интервьюерами в ведущих мировых корпорациях. Из тысяч возможных задач и вопросов в книгу были отобраны 189 наиболее интересных и значимых. Шестое издание этого мирового бестселлера поможет вам наилучшим образом подготовиться к собеседованию при приеме на работу программистом или руководителем в крупную IT-организацию или перспективный стартап. Основную часть книги составляют ответы на технические вопросы и задания, которые обычно получают соискатели на собеседовании в таких компаниях, как Google, Microsoft, Apple, Amazon и других. Рассмотрены типичные ошибки, а также эффективные методики поготовки к собеседованию. Используя материал этой книги, вы с легкостью подготовитесь к устройству на работу в Google, Microsoft или любую другую ведущую IT-компанию.\",\"imageurl\":\"http://books.google.com/books/content?id=qOweEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1024,\"name\":\"Парлог\",\"surname\":\"Николай\"}],\"id\":1012,\"title\":\"Система модулей Java\",\"isbn\":9785446116201,\"description\":\"Создать надёжное и безопасное приложение гораздо проще, если упаковать код в аккуратные блоки. Система модулей в Java представляет собой языковой стандарт для создания таких блоков. Теперь вы можете контролировать взаимодействия различных JAR и легко обнаруживать недостающие зависимости. Фундаментальные изменения архитектуры затронули ядро Java, начиная с версии 9. Все API ядра распространяются в виде модулей, а для библиотек, фреймворков и приложений аналогичный подход можно считать хорошей практикой и рекомендацией. Вы освоите наилучшие практики модульного проектирования, отладки приложения и его развертывания перед сдачей в продакшен. В этой книге - Архитектура модульного приложения Java. - Создание модулей: от исходников до JAR-файлов. - Миграция на версию Java с модулями. - Избавление от зависимостей и оттачивание API. - Обработка рефлексии и версионирование.\",\"imageurl\":\"http://books.google.com/books/content?id=1qceEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1025,\"name\":\"Laurentiu\",\"surname\":\"Spilca\"}],\"id\":1013,\"title\":\"Spring Security in Action\",\"isbn\":9781617297731,\"description\":\"Spring Security in Action shows you how to prevent cross-site scripting and request forgery attacks before they do damage. You’ll start with the basics, simulating password upgrades and adding multiple types of authorization. As your skills grow, you'll adapt Spring Security to new architectures and create advanced OAuth2 configurations. By the time you're done, you'll have a customized Spring Security configuration that protects against threats both common and extraordinary. Summary While creating secure applications is critically important, it can also be tedious and time-consuming to stitch together the required collection of tools. For Java developers, the powerful Spring Security framework makes it easy for you to bake security into your software from the very beginning. Filled with code samples and practical examples, Spring Security in Action teaches you how to secure your apps from the most common threats, ranging from injection attacks to lackluster monitoring. In it, you'll learn how to manage system users, configure secure endpoints, and use OAuth2 and OpenID Connect for authentication and authorization. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the technology Security is non-negotiable. You rely on Spring applications to transmit data, verify credentials, and prevent attacks. Adopting \\\"secure by design\\\" principles will protect your network from data theft and unauthorized intrusions. About the book Spring Security in Action shows you how to prevent cross-site scripting and request forgery attacks before they do damage. You’ll start with the basics, simulating password upgrades and adding multiple types of authorization. As your skills grow, you'll adapt Spring Security to new architectures and create advanced OAuth2 configurations. By the time you're done, you'll have a customized Spring Security configuration that protects against threats both common and extraordinary. What's inside Encoding passwords and authenticating users Securing endpoints Automating security testing Setting up a standalone authorization server About the reader For experienced Java and Spring developers. About the author Laurentiu Spilca is a dedicated development lead and trainer at Endava, with over ten years of Java experience. Table of Contents PART 1 - FIRST STEPS 1 Security Today 2 Hello Spring Security PART 2 - IMPLEMENTATION 3 Managing users 4 Dealing with passwords 5 Implementing authentication 6 Hands-on: A small secured web application 7 Configuring authorization: Restricting access 8 Configuring authorization: Applying restrictions 9 Implementing filters 10 Applying CSRF protection and CORS 11 Hands-on: A separation of responsibilities 12 How does OAuth 2 work? 13 OAuth 2: Implementing the authorization server 14 OAuth 2: Implementing the resource server 15 OAuth 2: Using JWT and cryptographic signatures 16 Global method security: Pre- and postauthorizations 17 Global method security: Pre- and postfiltering 18 Hands-on: An OAuth 2 application 19 Spring Security for reactive apps 20 Spring Security testing\",\"imageurl\":\"http://books.google.com/books/content?id=hjszEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1026,\"name\":\"Mark\",\"surname\":\"Heckler\"}],\"id\":1014,\"title\":\"Spring Boot: Up and Running\",\"isbn\":9781492076988,\"description\":\"With over 75 million downloads per month, Spring Boot is the most widely used Java framework available. Its ease and power have revolutionized application development from monoliths to microservices. Yet Spring Boot's simplicity can also be confounding. How do developers learn enough to be productive immediately? This practical book shows you how to use this framework to write successful mission-critical applications. Mark Heckler from VMware, the company behind Spring, guides you through Spring Boot's architecture and approach, covering topics such as debugging, testing, and deployment. If you want to develop cloud native Java or Kotlin applications with Spring Boot rapidly and effectively--using reactive programming, building APIs, and creating database access of all kinds--this book is for you. Learn how Spring Boot simplifies cloud native application development and deployment Build reactive applications and extend communication across the network boundary to create distributed systems Understand how Spring Boot's architecture and approach increase developer productivity and application portability Deploy Spring Boot applications for production workloads rapidly and reliably Monitor application and system health for optimal performance and reliability Debug, test, and secure cloud-based applications painlessly\",\"imageurl\":\"http://books.google.com/books/content?id=TQUaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[],\"id\":1015,\"title\":\"Java Persistence API и Hibernate\",\"isbn\":9785970606742,\"description\":\"Java Persistence - механизм, помогающий обеспечить сохранность данных после завершения программы, что является главной чертой современных приложений. Hibernate - наиболее популярный инструмент Java для работы с базами данных, предоставляющим автоматическое прозрачное объектно-реляционное отображение, что значительно упрощает работу с SQL-базами данных в приложениях Java. Данная книга описывает разработку приложения с использованием Hibernate, связывая воедино сотни отдельных примеров. Вы сразу окунетесь в богатую моделями программирования среду Hibernate, которая основывается на отображениях, запросах, стратегиях выборки, транзакциях, диалогах, кэшировании и многом другом. Здесь вы найдете хорошо иллюстрированное обсуждение лучших методик проектирования баз данных и методов оптимизации. Во втором издании авторы подробно описывают версию Hibernate 5 совместимый со стандартом Java Persistence 2.1. Все примеры обновлены для последних версий спецификаций Hibernate и Java..\",\"imageurl\":\"https://www.troykaonline.com/files/product/large/274576_9785970606742.jpg\"},{\"authors\":[],\"id\":1016,\"title\":\"Структуры данных и алгоритмы JAVA\",\"isbn\":9785446109395,\"description\":\"Второе издание одной из самых авторитетных книг по программированию посвящено использованию структур данных и алгоритмов, Алгоритмы — это основа программирования, определяющая, каким образом разрабатываемое программное обеспечение будет использовать структуры данных. На четких и простых программных примерах автор объясняет эту сложную тему, предлагая читателям написать собственные программы и на практике освоить полученные знания. Рассматриваемые примеры написаны на языке Java, хотя для усвоения материала читателю не обязательно хорошо знать его — достаточно владеть любым языком программирования, например C++. Первая часть книги представляет собой введение в алгоритмизацию и структуры данных, а также содержит изложение основ объектно-ориентированного программирования. Следующие части посвящены различным алгоритмам и структурам данных, рассматриваемым от простого к сложному: сортировка, абстрактные типы данных, связанные списки, рекурсия, древовидные структуры данных, хеширование, пирамиды, графы. Приводятся рекомендации по использованию алгоритмов и выбору той или иной структуры данных в зависимости от поставленной задачи.\",\"imageurl\":\"https://www.troykaonline.com/files/product/large/263213_9785446109395.jpg\"},{\"authors\":[],\"id\":1017,\"title\":\"SQL за 10 минут\",\"isbn\":9785604139394,\"description\":\"В книге предлагаются простые и практичные решения для тех, кто хочет быстро получить результат.\\nПроработав все 22 урока, на каждый из которых придется затратить не более 10 минут, вы узнаете обо всем, что необходимо для практического применения SQL.\\nПриведенные в книге примеры подходят для IBM DB2, Microsoft Access, Microsoft SQL Server, MySQL, Oracle, PostgreSQL, SQLite, MariaDB и Apache OpenOffice Base.\",\"imageurl\":\"https://www.knigosvet.com/img/w300/1432917.jpg\"},{\"authors\":[],\"id\":1018,\"title\":\"Регулярные выражения. Сборник рецептов\",\"isbn\":9785932862216,\"description\":\"Книга ведущих экспертов по регулярным выражениям содержит все необходимое для решения широкого спектра практических задач в виде более 140 проверенных рецептов. С ее помощью новички смогут обрести базовые навыки и освоить основные инструменты, а программисты и опытные пользователи найдут\\nв ней множество важных мелочей. Каждый рецепт содержит шаблоны, пригодные для немедленного применения.\\nВторое обновленное издание охватывает диалекты регулярных выражений, используемые в восьми языках программирования: С#, Java, JavaScript, Perl,\\nPHP, Python, Ruby и VB.NET. Вы познакомитесь с новыми приемами, научитесь обходить ловушки, имеющиеся в разных диалектах, и благодаря огромной библиотеке готовых решений сможете сэкономить свое время.\\nВ книге представлены пошаговые решения наиболее часто встречающихся задач: проверка и форматирование ввода пользователя, поиск и обработка слов,\\nспецсимволов и строк текста, работа с числами в различных форматах представления, работа с адресами URL, путями в файловой системе и IP-адресами, приемы работы с разметкой HTML, XML и с форматами обмена данными. Освоив\\nматериал книги, вы сможете полнее использовать все те возможности, которые\\nпредоставляет умелое применение регулярных выражений.\",\"imageurl\":\"https://static.pt1lib.org/covers299/books/50/fe/1f/50fe1f865d97e455a95b05008d058690.jpg\"},{\"authors\":[],\"id\":1019,\"title\":\"Регулярные выражения. 3-е издание\",\"isbn\":9785932861219,\"description\":\"Книга Джеффри Фридла \\\"Регулярные выражения\\\" откроет перед вами секрет высокой производительности. Тщательно продуманные регулярные выражения помогут избежать долгих часов утомительной работы и решить свои проблемы за 15 секунд.\",\"imageurl\":\"https://ruslania.com/pictures/books_photos/16/167258/9785932861219_d.jpg\"},{\"authors\":[],\"id\":1020,\"title\":\" JAVA EE 7 ОСНОВЫ\",\"isbn\":9785845918963,\"description\":\"No description\",\"imageurl\":\"https://model.lfab.ru/pics/3277560/8545325182.jpg\"},{\"authors\":[],\"id\":1021,\"title\":\"Java: оптимизация программ. Практические методы повышения производительности приложений в JVM\",\"isbn\":9785907114845,\"description\":\"Настройка производительности — наука экспериментальная, но это не означает, что инженеры должны прибегать к догадкам и фольклору, чтобы выполнить свою работу (хотя часто случается именно так). С помощью этой практической книги разработчики средней и высокой квалификации, работающие со сложными стеками технологий, научатся настраивать высокую производительность Java-приложений, используя количественный, поддающийся проверке подход. В большинстве информационных ресурсов о производительности, как правило, обсуждаются теория и внутреннее устройство виртуальных машин Java, но в этой книге основное внимание уделяется практическим возможностям настройки производительности путем изучения широкого ряда аспектов. В книге нет простых рецептов, советов и трюков или алгоритмов. Настройка производительности — это процесс внесения изменений и измерения полученных результатов, требующий усердия.\",\"imageurl\":\"https://content2.rozetka.com.ua/goods/images/big/164689627.jpg\"},{\"authors\":[],\"id\":1022,\"title\":\"Лямбда-выражения в Java 8\",\"isbn\":9785970604632,\"description\":\"Если вы имеете опыт работы с Java SE, то из этой книги узнаете об изменениях в версии Java 8, обусловленных появлением в языке лямбда-выражений. Вашему вниманию будут представлены примеры кода, упражнения и увлекательные объяснения того, как можно использовать эти анонимные функции, чтобы сделать код проще и чище, и как библиотеки помогают в решении прикладных задач.\\nЛямбда-выражения - относительно простое изменение в языке Java; в первой части книги показано, как правильно ими пользоваться. В последующих главах демонстрируется, как лямбда-выражения позволяют повысить производительность программы за счет распараллеливания, писать более простой конкурентный код и точнее моделировать предметную область, в том числе создавать более качественные предметно-ориентированные языки.\\nИздание предназначено для программистов разной квалификации, как правило уже работающих с Java, но не имеющих опыта функционального программирования.\",\"imageurl\":\"https://www.troykaonline.com/files/product/large/115087_9785970604632.jpg\"},{\"authors\":[],\"id\":1023,\"title\":\"Java SE 9. Базовый курс. 2-е изд.\",\"isbn\":9785604004302,\"description\":\"Главные усовершенствования в последней, девятой версии Java, оказавшие благотворное влияние на базовые технологии и прикладные программные интерфейсы (API), сосредоточены в основном на платформе Java. Многие из прежних идиом Java больше не нужны, а новые средства вроде модуляризации заметно повышают эффективность труда разработчиков, хотя выявить подобные перемены не так-то просто. Эта книга является полным, хотя и кратким справочником по версии Java SE 9. Она написана Кеем С. Хорстманном, автором классического двухтомного справочника по предыдущим версиям Java, и служит незаменимым учебным пособием для быстрого и легкого изучения этого языка и его библиотек. Учитывая масштабы Java и область действия усовершенствований, внедренных в версии Java SE 9, материал этой книги подается небольшими порциями для быстроты усвоения и простоты понимания. Многочисленные практические рекомендации автора книги и примеры кода помогут читателям, имеющим опыт программирования на Java, быстро воспользоваться преимуществами как долгожданной и наконец-то внедренной модульной системы на платформе Java, занявшей свое законное место в процессе разработки проекта, так и языковых средств, внедренных еще в версии Java 8, включая лямбда-выражения и потоки данных.\",\"imageurl\":\"https://www.troykaonline.com/files/product/large/260624_9785604004302.jpg\"},{\"authors\":[],\"id\":1024,\"title\":\"Современный JavaScript для нетерпеливых\",\"isbn\":9785970601778,\"description\":\"Язык JavaScript изначально был предназначен для написания небольших объемов кода внутри браузера, но современный JavaScript радикально отличается от своего прародителя. В наши дни программисты на JavaScript активно осваивают функциональный, объектно-ориентированный и асинхронный стили программирования, оставляя в прошлом архаичные конструкции, чреватые ошибками. Данная книга – полное, но при этом лаконичное руководство по версии JavaScript E6 и выше. Вам не потребуется знаний старых версий языка, а сразу предлагается начать с более мощных современных. Автор бестселлеров Кэй С. Хорстман рассказывает обо всем, что вам необходимо знать, излагая материал небольшими порциями, рассчитанными на легкое усвоение. Практические советы и примеры кода помогут эффективно воспользоваться всеми новшествами, избежать подводных камней и устаревших средств и извлечь максимум пользы из надежных инструментов и фреймворков для разработки ПО на современном JavaScript. Издание предназначено...\",\"imageurl\":\"https://www.troykaonline.com/files/product/large/394895_9785970601778.jpg\"},{\"authors\":[],\"id\":1025,\"title\":\"Java Concurrency in Practice\",\"isbn\":9780321349606,\"description\":\"\\\"I was fortunate indeed to have worked with a fantastic team on the design and implementation of the concurrency features added to the Java platform in Java 5.0 and Java 6. Now this same team provides the best explanation yet of these new features, and of concurrency in general. Concurrency is no longer a subject for advanced users only. Every Java developer should read this book.\\\"\",\"imageurl\":\"https://pictures.abebooks.com/isbn/9780321349606-us.jpg\"},{\"authors\":[],\"id\":1026,\"title\":\"Spring в действии\",\"isbn\":9785970601716,\"description\":\"Фреймворк Spring Framework - необходимый инструмент для разработчиков приложений на Java.\\nВ книге описана последняя версия Spring 3, который несет в себе новые мощные особенности, такие как язык выражений SpEL, новые аннотации для работы с контейнером IoC и поддержка архитектуры REST. Автор, Крейг Уоллс, обладает особым талантом придумывать весьма интересные примеры, сосредоточенные на особенностях и приемах использования Spring, которые действительно будут полезны читателям.\\nВ русскоязычном переводе добавлены главы из 2-го американского издания, которые автор не включил в 3-е издание \\\"Spring in Action\\\".\\nИздание предназначено как для начинающих пользователей фреймворка, так и для опытных пользователей Spring, желающих задействовать новые возможности версии 3.0.\\n3-е издание.\",\"imageurl\":\"https://www.troykaonline.com/files/product/large/978-5-97060-171-6.jpg\"},{\"authors\":[],\"id\":1027,\"title\":\"Spring 5 для профессионалов \",\"isbn\":9785907114074,\"description\":\"Эта книга воплощает знания и опыт работы авторов с каркасом Spring Framework и сопутствующими технологиями удаленного взаимодействия, Hibernate, EJB и пр. Она дает возможность читателю не только усвоить основные понятия и принципы работы с Spring Framework, но и научиться рационально пользоваться этим каркасом для построения различных уровней и частей корпоративных приложений на языке Java, включая обработку транзакций, представление веб-содержимого и прочего содержимого, развертывание и многое другое. Полноценные примеры подобных приложений, представленные в этой книге, наглядно демонстрируют особенности совместного применения различных технологий и методик разработки приложений в Spring.\",\"imageurl\":\"https://content2.rozetka.com.ua/goods/images/big/162265156.jpg\"},{\"authors\":[],\"id\":1028,\"title\":\"Kotlin. Сборник рецептов\",\"isbn\":9785970608838,\"description\":\"Из этого уникального сборника рецептов разработчики узнают, как применять язык Kotlin в Java-проектах.\\n\\nПрактические рецепты будут полезны не только новичкам в Kotlin, но и опытным программистам. Кен Коузен показывает, как решать проблемы, исходя из конкретных вариантов использования, а не из базового синтаксиса Kotlin.  Вы задаете вопрос, а эта книга дает ответ. Kotlin уже довольно широко используется в разработке для Android, но его можно использовать везде, где применяется Java, а также для разработки в iOS, для создания приложений в машинном коде, для генерации кода на JavaScript и т. д.\\n\\nПрисоединяйтесь к сообществу Kotlin и начинайте создавать новые проекты уже сегодня!\",\"imageurl\":\"https://content2.rozetka.com.ua/goods/images/big/160953824.jpg\"},{\"authors\":[],\"id\":1029,\"title\":\"Kotlin в действии\",\"isbn\":9785970604977,\"description\":\"Язык Kotlin предлагает выразительный синтаксис, мощную и понятную систему типов, великолепную поддержку и бесшовную совместимость с существующим кодом на Java, богатый выбор библиотек и фреймворков. Kotlin может компилироваться в байт-код Java, поэтому его можно использовать везде, где используется Java, включая Android. А благодаря эффективному компилятору и маленькой стандартной библиотеке, Kotlin практически не привносит накладных расходов. Данная книга научит вас пользоваться языком Kotlin для создания высококачественных приложений. Написанная создателями языка – разработчиками в компании JetBrains - эта книга охватывает такие темы, как создание предметно-ориентированных языков, функциональное программирование в JVM, совместное использование Java и Kotlin и др. Издание предназначено разработчикам, владеющим языком Java и желающим познакомиться и начать эффективно работать с Kotlin.\",\"imageurl\":\"https://ruslania.com/pictures/books_photos/61/612383/9785970604977_d.jpg\"},{\"authors\":[],\"id\":1030,\"title\":\"Волшебство Kotlin\",\"isbn\":9785970608012,\"description\":\"Kotlin - один из самых новых языков в экосистеме Java, устраняющий многие ограничения Java и гораздо более универсальный. Среди его преимуществ: полная совместимость с Java и возможность интеграции на уровне исходного кода, широкая поддержка парадигмы функционального программирования, помогающая писать надежный и безопасный код, лаконичность синтаксиса, а также, что весьма немаловажно, гарантии поддержки со стороны IT-гиганта Google.Пьер-Ив Сомон, опытный разработчик на Java, в своей книге подробно освещает нюансы программирования на Kotlin, переходя от общего описания языка к его характерным особенностям и возможностям, включая приемы функционального программирования.Издание предназначено для разработчиков, знакомых с Java и стремящихся повысить безопасность своих программ, а также упростить их написание, тестирование и сопровождение.\",\"imageurl\":\"https://www.troykaonline.com/files/product/large/352296_9785970608012.jpg\"},{\"authors\":[],\"id\":1031,\"title\":\"Unix и Linux: руководство системного администратора\",\"isbn\":9785907144101,\"description\":\"Это современное и полное руководство по инсталляции, настройке и обслуживанию любой системы UNIX или Linux, включая системы, предоставляющие базовую инфраструктуру Интернета и облачную инфраструктуру.\",\"imageurl\":\"https://dokumen.pub/img/200x200/unix-linux-5nbsped-9785907144101.jpg\"},{\"authors\":[],\"id\":1032,\"title\":\"Алгоритмы на Java\",\"isbn\":9785907114739,\"description\":\"Книга Седжвика и Уэйна «АЛГОРИТМЫ на Java» является классическим справочным руководством в котором содержится необходимый объем знаний для программиста в области алгоритмов, накопленных за последние несколько десятилетий. В книге «АЛГОРИТМЫ на Java» представлен широкий спектр рассматриваемых тем: исчерпывающее толкование структур данных и алгоритмов сортировки, поиска, обработки графов и строк, включая пятьдесят алгоритмов (смотри algs4.cs.princeton.edu/code), которые должен знать каждый программист. Описываются новые реализации алгоритмов на Java, написанные в ясном модульном стиле, при котором весь код доступен читателю и полностью готов к использованию. В книге изучение алгоритмов на Java ведется в контексте важнейших научных, инженерных и коммерческих приложений. Клиенты и алгоритмы выражены с помощью реального кода, а не псевдокода, как во многих других книгах. Книга «АЛГОРИТМЫ на Java» отличается от множества других ясным и кратким текстом, детальными примерами с иллюстрациями, тщательно подобранным кодом, историческим и научным контекстом, а также упражнениями для самостоятельной проработки на всех уровнях. В книге представлены точные соображения относительно производительности, поддерживаемые соответствующими математическими моделями и эмпирическими исследованиями, которые подтверждают достоверность этих моделей. Книга Седжвика и Уэйна «АЛГОРИТМЫ на Java» поддерживается в Интернет веб-сайтом algs4.cs.princeton.edu, на котором содержатся дайджесты, коды программ, тестовые данные, программные проекты, упражнения, слайды для лекций и другие полезные ресурсы\",\"imageurl\":\"https://content1.rozetka.com.ua/goods/images/big/208428125.jpg\"},{\"authors\":[],\"id\":1033,\"title\":\"High-Performance Java Persistence\",\"isbn\":9789730228236,\"description\":\"A high-performance data access layer must resonate with the underlying database system. Knowing the inner workings of a relational database and the data access frameworks in use can make the difference between a high-performance enterprise application and one that barely crawls.This book is a journey into Java data access performance tuning. From connection management, to batch updates, fetch sizes and concurrency control mechanisms, it unravels the inner workings of the most common Java data access frameworks.The first part aims to reduce the gap between application developers and database administrators. For this reason, it covers both JDBC and the database fundamentals that are of paramount importance when reducing transaction response times. In this first part, you'll learn about connection management, batch updates, statement caching, result set fetching and database transactions.The second part demonstrates how you can take advantage of JPA and Hibernate without compromising application performance. In this second part, you'll learn about the most efficient Hibernate mappings (basic types, associations, inheritance), fetching best practices, caching and concurrency control mechanisms.The third part is dedicated to jOOQ and its powerful type-safe querying capabilities, like window functions, common table expressions, upsert, stored procedures and database functions.\\n\",\"imageurl\":\"https://pictures.abebooks.com/isbn/9789730228236-us.jpg\"},{\"authors\":[{\"id\":1027,\"name\":\"Гифт\",\"surname\":\"Ной\"},{\"id\":1030,\"name\":\"Георгиу\",\"surname\":\"Григ\"},{\"id\":1028,\"name\":\"Берман\",\"surname\":\"Кеннеди\"},{\"id\":1029,\"name\":\"Деза\",\"surname\":\"Альфредо\"}],\"id\":1034,\"title\":\"Python и DevOps: Ключ к автоматизации Linux\",\"isbn\":9785446129294,\"description\":\"За последнее десятилетие технологии сильно изменились. Данные стали хитом, облака — вездесущими, и всем организациям понадобилась автоматизация. В ходе таких преобразований Python оказался одним из самых популярных языков программирования. Это практическое руководство научит вас использовать Python для повседневных задач администрирования Linux с помощью наиболее удобных утилит DevOps, включая Docker, Kubernetes и Terraform.\",\"imageurl\":\"http://books.google.com/books/content?id=-LpLEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[{\"id\":1031,\"name\":\"Magnus\",\"surname\":\"Larsson\"}],\"id\":1035,\"title\":\"Hands-On Microservices with Spring Boot and Spring Cloud\",\"isbn\":9781789613476,\"description\":\"Apply microservices patterns to build resilient and scalable distributed systems Key Features Understand the challenges of building large-scale microservice landscapes Build cloud-native production-ready microservices with this comprehensive guide Discover how to get the best out of Spring Cloud, Kubernetes, and Istio when used together Book Description Microservices architecture allows developers to build and maintain applications with ease, and enterprises are rapidly adopting it to build software using Spring Boot as their default framework. With this book, you'll learn how to efficiently build and deploy microservices using Spring Boot. This microservices book will take you through tried and tested approaches to building distributed systems and implementing microservices architecture in your organization. Starting with a set of simple cooperating microservices developed using Spring Boot, you'll learn how you can add functionalities such as persistence, make your microservices reactive, and describe their APIs using Swagger/OpenAPI. As you advance, you'll understand how to add different services from Spring Cloud to your microservice system. The book also demonstrates how to deploy your microservices using Kubernetes and manage them with Istio for improved security and traffic management. Finally, you'll explore centralized log management using the EFK stack and monitor microservices using Prometheus and Grafana. By the end of this book, you'll be able to build microservices that are scalable and robust using Spring Boot and Spring Cloud. What you will learn Build reactive microservices using Spring Boot Develop resilient and scalable microservices using Spring Cloud Use OAuth 2.0/OIDC and Spring Security to protect public APIs Implement Docker to bridge the gap between development, testing, and production Deploy and manage microservices using Kubernetes Apply Istio for improved security, observability, and traffic management Who this book is for This book is for Java and Spring developers and architects who want to learn how to break up their existing monoliths into microservices and deploy them either on-premises or in the cloud using Kubernetes as a container orchestrator and Istio as a service Mesh. No familiarity with microservices architecture is required to get started with this book.\",\"imageurl\":\"http://books.google.com/books/content?id=h_jKxgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api\"},{\"authors\":[{\"id\":1032,\"name\":\"Moisés\",\"surname\":\"Macero\"}],\"id\":1036,\"title\":\"Learn Microservices with Spring Boot 3\",\"isbn\":9781484261309,\"description\":\"Build Java-based microservices architecture using the Spring Boot 3 framework by evolving an application from a small monolith to an event-driven architecture composed of several services. This revised book follows an incremental approach in teaching the structure of microservices, test-driven development, Eureka, Ribbon, Zuul, and end-to-end tests with Cucumber. This updated book now covers what's been added to the new Spring Boot 3 release, including support for the latest Java SE LTS; changes to the Stream Editor UI; Maven preemptive authentication; building Docker images using cloud-native build packs; building layered jars for optimized Docker images; E2E traceability for configuration properties; many dependency upgrades; support for Spring Data Neumann; and more. Author Moises Macero uses a pragmatic approach to explain the benefits of using this type of software architecture, instead of keeping you distracted with theoretical concepts. He covers some of the state-of-the-art techniques in computer programming, from a practical point of view. You’ll focus on what's important, starting with the minimum viable product but keeping the flexibility to evolve it. What You Will Learn Build microservices with Spring Boot 3 Use event-driven architecture and messaging with RabbitMQ Master service discovery with Eureka and load balancing with Ribbon Route requests with Zuul as your API gateway Write end-to-end tests for an event-driven architecture using Cucumber Carry out continuous integration and deployment Who This Book Is For Those with at least some prior experience with Java programming. Some prior exposure to Spring Boot recommended but not required.\",\"imageurl\":\"http://books.google.com/books/content?id=_CyTzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api\"},{\"authors\":[{\"id\":1033,\"name\":\"JJ\",\"surname\":\"Geewax\"}],\"id\":1038,\"title\":\"API Design Patterns\",\"isbn\":9781617295850,\"description\":\"API Design Patterns lays out a set of design principles for building internal and public-facing APIs. Summary A collection of best practices and design standards for web and internal APIs. In API Design Patterns you will learn: Guiding principles for API patterns Fundamentals of resource layout and naming Handling data types for any programming language Standard methods that ensure predictability Field masks for targeted partial updates Authentication and validation methods for secure APIs Collective operations for moving, managing, and deleting data Advanced patterns for special interactions and data transformations API Design Patterns reveals best practices for building stable, user-friendly APIs. These design patterns can be applied to solve common API problems and flexibly altered to fit your specific needs. Hands-on examples and relevant use-cases illustrate patterns for API fundamentals, advanced functionalities, and even uncommon scenarios. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the technology APIs are contracts that define how applications, services, and components communicate. API design patterns provide a shared set of best practices, specifications and standards that ensure APIs are reliable and simple for other developers to use. This book collects and explains the most important patterns from both the API design community and the experts at Google. About the book API Design Patterns lays out a set of design principles for building internal and public-facing APIs. Google API expert JJ Geewax presents patterns that ensure your APIs are consistent, scalable, and flexible. You’ll improve the design of the most common APIs, plus discover techniques for tricky edge cases. Precise illustrations, relevant examples, and detailed scenarios make every pattern clear and easy to understand. What's inside Guiding principles for API patterns Fundamentals of resource layout and naming Advanced patterns for special interactions and data transformations A detailed case-study on building an API and adding features About the reader For developers building web and internal APIs in any language. About the author JJ Geewax is a software engineer at Google, focusing on Google Cloud Platform, API design, and real-time payment systems. He is also the author of Manning’s Google Cloud Platform in Action. Table of Contents PART 1 INTRODUCTION 1 Introduction to APIs 2 Introduction to API design patterns PART 2 DESIGN PRINCIPLES 3 Naming 4 Resource scope and hierarchy 5 Data types and defaults PART 3 FUNDAMENTALS 6 Resource identification 7 Standard methods 8 Partial updates and retrievals 9 Custom methods 10 Long-running operations 11 Rerunnable jobs PART 4 RESOURCE RELATIONSHIPS 12 Singleton sub-resources 13 Cross references 14 Association resources 15 Add and remove custom methods 16 Polymorphism PART 5 COLLECTIVE OPERATIONS 17 Copy and move 18 Batch operations 19 Criteria-based deletion 20 Anonymous writes 21 Pagination 22 Filtering 23 Importing and exporting PART 6 SAFETY AND SECURITY 24 Versioning and compatibility 25 Soft deletion 26 Request deduplication 27 Request validation 28 Resource revisions 29 Request retrial 30 Request authentication\",\"imageurl\":\"http://books.google.com/books/content?id=XWU0EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api\"},{\"authors\":[],\"id\":1039,\"title\":\"Предметно-ориентированное проектирование (DDD)\",\"isbn\":9785604072493,\"description\":\"Классическая книга Э.Эванса освещает наиболее общий, стратегический круг вопросов, связанных с объектно-ориентированной разработкой программного обеспечения. Это переработка и структуризация знаний о предметных областях, применение типовых архитектурных шаблонов, построение и анализ моделей предметных областей, проектирование программных объектов с точки зрения качества их взаимодействия и передачи логической структуры знаний, организация программ на основе крупномасштабных структур, выработка общего языка и стратегии коммуникации в группе. Подход автора строится на динамичном рефакторинге модели и постоянной дистилляции знаний. Это позволяет достигнуть высокой степени гармонии между логикой предметной области и кодом программы, а также достаточной гибкости программной архитектуры для целей у..\",\"imageurl\":\"https://ruslania.com/pictures/books_photos/20/206897/9785604072493_d.jpg\"},{\"authors\":[],\"id\":1040,\"title\":\"Оптимизация запросов в PostgreSQL\",\"isbn\":9785970609637,\"description\":\"Книга поможет вам писать запросы, которые выполняются быстро и вовремя\\nдоставляют результаты. Вы научитесь смотреть на процесс написания запроса\\nс точки зрения механизма базы данных и начнете думать, как оптимизатор базы\\nданных. Объясняется, как читать и понимать планы выполнения запросов, какие\\nсуществуют методы воздействия на них с точки зрения оптимизации произво-\\nдительности, и показано, как эти методы используются вместе для создания\\nэффективных приложений.\\nИздание предназначено разработчикам и администраторам баз данных,\\nа также системным архитекторам, использующим PostgreSQL.\",\"imageurl\":\"https://readrate.com/img/pictures/book/248/248098/2480985/w240h400-516130c5.jpg\"},{\"authors\":[],\"id\":1041,\"title\":\"Java Coding Problems: Improve your Java Programming skills by solving real-world coding challenges\",\"isbn\":9781789801415,\"description\":\"Develop your coding skills by exploring Java concepts and techniques such as Strings, Objects and Types, Data Structures and Algorithms, Concurrency, and Functional programming\\nKey Features\\n\\nSolve Java programming challenges and get interview-ready by using the power of modern Java 8-12\\nTest your Java skills using language features, algorithms, data structures, functional design patterns, concurrency, HTTP Client API and much more\\nExplore 300+ applications covering 1000+ coding solutions\\nBook Description The super-fast evolution of the...\",\"imageurl\":\"https://pictures.abebooks.com/isbn/9781789801415-us.jpg\"},{\"authors\":[],\"id\":1042,\"title\":\"SQL. Сборник рецептов\",\"isbn\":9785977567596,\"description\":\"Рассмотрены готовые рецепты для решения практических задач при работе с СУБД Oracle, DB2, SQL Server, MySQL и PostgreSQL. Описаны извлечение записей из таблиц, сортировка результатов запросов, принципы работы с несколькими таблицами, обработка запросов с метаданными. Рассказывается о способах поиска данных средствами SQL,о составлении отчетов и форматировании результирующих множеств, работе с иерархическими запросами. Рассматривается использование оконных функций, обобщенных табличных выражений (ОТВ), сбор данных в блоки, формирование гистограмм, текущих сумм и подсумм, агрегация скользящего диапазона значений. Описан обход строки и ее синтаксический разбор на символы, приведены способы упрощения вычислений внутри строки. Во втором издании учтены все изменения в синтаксисе и архитектуре актуальных реализаций SQL.\",\"imageurl\":\"https://media.b-stock.ru/gallery/4724787.jpeg\"},{\"authors\":[],\"id\":1043,\"title\":\"Микросервисы Spring в действии\",\"isbn\":9785970609712,\"description\":\"Spring существенно упрощает создание и развертывание микросервисов! Такие библиотеки, как Spring Boot, Spring Cloud и Spring Cloud Gateway, помогают уменьшить объем типового кода в службах REST. Они предоставляют эффективный набор инструментов для запуска микросервисов как в общедоступных, так и в частных облаках. Книга учит создавать приложения на основе микросервисов с использованием Java и Spring. Начав с создания простых служб, вы постепенно перейдете к знакомству с приемами эффективного журналирования и мониторинга. Научитесь реструктурировать приложения на Java с помощью интуитивно понятных инструментов Spring и освоите управление API с помощью Spring Cloud Gateway. Также вы будете учиться развертывать приложения Spring Cloud в AWS и Kubernetes.\\n\\nИздание предназначено для опытных разработчиков на Java и Spring.\",\"imageurl\":\"https://cdn1.ozone.ru/s3/multimedia-h/wc1200/6191929913.jpg\"},{\"authors\":[],\"id\":1048,\"title\":\"Beginning Hibernate. For Hibernate 5\",\"isbn\":9781484223185,\"description\":\"Get started with the Hibernate 5 persistence layer and gain a clear introduction to the current standard for object-relational persistence in Java. This updated edition includes the new Hibernate 5.0 framework as well as coverage of NoSQL, MongoDB, and other related technologies, ranging from applications to big data. Beginning Hibernate is ideal if you’re experienced in Java with databases (the traditional, or connected, approach), but new to open-source, lightweight Hibernate.\\n\\nThe book keeps its focus on Hibernate without wasting time on nonessential third-party tools, so you’ll be able to immediately start building transaction-based engines and applications. Experienced authors Joseph Ottinger with Dave Minter and Jeff Linwood provide more in-depth examples than any other book for Hibernate beginners. They present their material in a lively, example-based manner—not a dry, theoretical, hard-to-read fashion.\",\"imageurl\":\"https://cdn1.ozone.ru/s3/multimedia-p/c360/6010093381.jpg\"},{\"authors\":[],\"id\":1049,\"title\":\"Java Persistence with Hibernate\",\"isbn\":9781617290459,\"description\":\"Java Persistence with Hibernate, Second Edition explores Hibernate by developing an application that ties together hundreds of individual examples. In this revised edition, authors Christian Bauer, Gavin King, and Gary Gregory cover Hibernate 5 in detail with the Java Persistence 2.1 standard (JSR 338). All examples have been updated for the latest Hibernate and Java EE specification versions.\",\"imageurl\":\"https://pictures.abebooks.com/isbn/9781617290459-us.jpg\"},{\"authors\":[],\"id\":1050,\"title\":\"Spring Start Here: Learn what You Need and Learn it Well\",\"isbn\":9781617298691,\"description\":\"Spring Start Here teaches Java developers how to build applications using Spring framework. Informative graphics, relevant examples, and author Laurenţiu Spilcă's clear and lively writing make it easy to pick up the skills you need. You'll discover how to plan, write, and test applications. And by concentrating on the most important features, this no-nonsense book gives you a firm foundation for exploring Spring's rich ecosystem.\",\"imageurl\":\"https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/6172/9781617298691.jpg\"},{\"authors\":[],\"id\":1051,\"title\":\"Spring in Action, Sixth Edition\",\"isbn\":9781617297571,\"description\":\"If you need to learn Spring, look no further than this widely beloved and comprehensive guide! Fully revised for Spring 5.3, and packed with interesting real-world examples to get your hands dirty with\",\"imageurl\":\"https://images.manning.com/book/c/108ea71-54af-47b6-9c39-148a1dc0ce4c/Walls-Spring-6ed-HI.png\"},{\"authors\":[],\"id\":1052,\"title\":\"The Complete Coding Interview Guide in Java: An effective guide for aspiring Java developers to ace their programming interviews\",\"isbn\":9781839212062,\"description\":\"Java is one of the most sought-after programming languages in the job market, but cracking the coding interview in this challenging economy might not be easy. This comprehensive guide will help you to tackle various challenges faced in a coding job interview and avoid common interview mistakes, and will ultimately guide you toward landing your job as a Java developer.\\n\\nThis book contains two crucial elements of coding interviews - a brief section that will take you through non-technical interview questions, while the more comprehensive part covers over 200 coding interview problems along with their hands-on solutions. This book will help you to develop skills in data structures and algorithms, which technical interviewers look for in a candidate, by solving various problems based on these topics covering a wide range of concepts such as arrays, strings, maps, linked lists, sorting, and searching. You'll find out how to approach a coding interview problem in a structured way that produces faster results. Toward the final chapters, you'll learn to solve tricky questions about concurrency, functional programming, and system scalability.\",\"imageurl\":\"https://cdn1.ozone.ru/s3/multimedia-l/wc1200/6160529241.jpg\"},{\"authors\":[],\"id\":1053,\"title\":\" Hands-On High Performance with Spring\",\"isbn\":9781788838382,\"description\":\"A hands-on guide to creating, monitoring, and tuning a high performance Spring web application About This Book • Understand common performance pitfalls and improve your application's performance • Build and deploy strategies for complex applications using the microservice architecture • Understand internals of JVM - the core of all Java Runtime Environments Who This Book Is For If you're a Spring developer who'd like to build high performance applications and have more control over your application's performance in production and development, this book is for you. Some familiarity with Java, Maven, and Eclipse is necessary. What You Will Learn • Master programming best practices and performance improvement with bean wiring • Analyze the performance of various AOP implementations • Explore database interactions with Spring to optimize design and configuration • Solve Hibernate performance issues and traps • Leverage multithreading and concurrent programming to improve application performance • Gain a solid foundation in JVM performance tuning using various tools • Learn the key concepts of the microservice architecture and how to monitor them • Perform Spring Boot performance tuning, monitoring, and health checks In Detail While writing an application, performance is paramount. Performance tuning for real-world applications often involves activities geared toward detecting bottlenecks. The recent release of Spring 5.0 brings major advancements in the rich API provided by the Spring framework, which means developers need to master its tools and techniques to achieve high performance applications. Hands-On High Performance with Spring 5 begins with the Spring framework's core features, exploring the integration of different Spring projects. It proceeds to evaluate various Spring specifications to identify those adversely affecting performance. You will learn about bean wiring configurations, aspect-oriented programming, database interaction, and Hibernate to focus on the metrics that help identify performance bottlenecks. You will also look at application monitoring, performance optimization, JVM internals, and garbage collection optimization. Lastly, the book will show you how to leverage the microservice architecture to build a high performance and resilient application. By the end of the book, you will have gained an insight into various techniques and solutions to build and troubleshoot high performance Spring-based applications. Style and approach This book takes a step-by-step approach with focused examples to teach you how to increase application performance.\",\"imageurl\":\"https://cdn1.ozone.ru/s3/multimedia-s/wc1200/6123628888.jpg\"},{\"authors\":[],\"id\":1054,\"title\":\"Kafka in Action\",\"isbn\":9781617295232,\"description\":\"Master the wicked-fast Apache Kafka streaming platform through hands-on examples and real-world projects.\",\"imageurl\":\"https://images.manning.com/book/1/245d360-5b78-4e51-9415-5147296a7fd5/Scott-Kafka-HI.png\"},{\"authors\":[],\"id\":1055,\"title\":\"Designing APIs with Swagger and OpenAPI\",\"isbn\":9781617296284,\"description\":\"Follow real-world API projects from concept to production, and learn hands-on how to describe and design APIs using OpenAPI.\",\"imageurl\":\"https://images.manning.com/264/352/resize/book/6/7659d47-0a9b-4da1-b7c0-b9dfc668f462/Ponelat-Designing-HI.png\"},{\"authors\":[],\"id\":1056,\"title\":\"КОМПЬЮТЕРНЫЕ СИСТЕМЫ. АРХИТЕКТУРА И ПРОГРАММИРОВАНИЕ\",\"isbn\":9785970604922,\"description\":\"В книге описываются стандартные элементы архитектуры, такие как центральный процессор, память, порты ввода-вывода, а также операционная система, компилятор, компоновщик и сетевое окружение. Демонстрируются способы представления данных и программ на машинном уровне, приемы оптимизации программ, особенности управления потоками выполнения и виртуальной памятью, а также методы сетевого и параллельного программирования. \",\"imageurl\":\"https://dmkpress.com/images/cms/thumbs/a5b0aeaa3fa7d6e58d75710c18673bd7ec6d5f6d/x978-5-97060-492-2_new_270_369_jpg__100.jpg.pagespeed.ic.2zzauAwTJ_.webp\"},{\"authors\":[],\"id\":1057,\"title\":\"Kafka в действии\",\"isbn\":9785937001184,\"description\":\"Apache Kafka можно рассматривать как высокопроизводительную программную шину, которая упрощает потоковую передачу событий, журналирование, анализ и другие задачи, решаемые в рамках конвейеров данных. С помощью Kafka вы легко встроите такие функции, как оперативный мониторинг данных и масштабная обработка событий, и в крупные, и в небольшие приложения.\",\"imageurl\":\"https://dmkpress.com/images/cms/thumbs/a5b0aeaa3fa7d6e58d75710c18673bd7ec6d5f6d/x978-5-93700-118-4_270_369_jpg__100.jpg.pagespeed.ic.0irVMMk9tV.webp\"},{\"authors\":[],\"id\":1058,\"title\":\"Spring Boot In Practice\",\"isbn\":9781617298813,\"description\":\"Spring Boot in Practice is full of practical recipes for common development problems in Spring Boot. Author Somnath Musib has spent years building applications with Spring, and he shares that extensive experience in this focused guide. You’ll master techniques for using Spring Data, Spring Security, and other Spring-centric solutions. Learn how to work with Spring Boot and Kotlin, handling connections for multiple platforms, and how Spring Boot can simplify building microservices and APIs. Each recipe is built around a real-world problem, complete with a full solution and thoughtful discussion.\",\"imageurl\":\"https://images.manning.com/360/480/resize/book/e/4bef175-7d20-45d2-a867-b56b6874754e/Musib-SB-HI.png\"},{\"authors\":[],\"id\":1059,\"title\":\"The Well-Grounded Java Developer\",\"isbn\":9781617298875,\"description\":\"The Well-Grounded Java Developer, Second Edition introduces both the modern innovations and timeless fundamentals you need to know to become a Java master. Authors Ben Evans, Martijn Verburg, and Jason Clark distill their decades of experience as Java Champions, veteran developers, and key contributors to the Java ecosystem into this clear and practical guide. You’ll discover how Java works under the hood and learn design secrets from Java’s long history. Each concept is illustrated with hands-on examples, including a fully modularized application/library and creating your own multithreaded application.\",\"imageurl\":\"https://images.manning.com/264/352/resize/book/8/211404c-5150-4359-9596-e9026710d5df/Evans2ed-HI.png\"},{\"authors\":[],\"id\":1060,\"title\":\"System Design. Подготовка к сложному интервью\",\"isbn\":9785446118168,\"description\":\"Интервью по System Design (проектированию ИТ-систем) очень популярны у работодателей, на них легко проверить ваши навыки общения и оценить умение решать реальные задачи.\\nПройти такое собеседование непросто, поскольку в проектировании ИТ-систем не существует единственно правильных решений. Речь идет о самых разнообразных реальных системах, обладающих множеством особенностей. Вам могут предложить выбрать общую архитектуру, а потом пройтись по всем компонентам или, наоборот, сосредоточиться на каком-то одном аспекте. Но в любом случае вы должны продемонстрировать понимание и знание системных требований, ограничений и узких мест.\\nПодробнее: https://www.labirint.ru/books/843295/\",\"imageurl\":\"https://img3.labirint.ru/rc/9dede20693236c7fdff84cec51074910/363x561q80/books85/843295/cover.jpg?1643700309\"},{\"authors\":[],\"id\":1061,\"title\":\"Cloud Native Spring in Action\",\"isbn\":9781617298424,\"description\":\"Cloud Native Spring in Action is a practical guide to building applications that are designed for cloud environments. You’ll learn effective Spring and Kubernetes cloud development techniques that you can immediately apply to enterprise-grade applications. Follow a detailed and complete cloud native system from first concept right through to production and deployment, learning best practices, design patterns, and little-known tips and tricks for pain-free cloud native development. Including coverage of security, continuous delivery, and configuration, this hands-on guide is the perfect primer for navigating the increasingly complex cloud landscape.\",\"imageurl\":\"https://images.manning.com/264/352/resize/book/5/f2961c6-0fd0-40c3-bf84-3f2ee281e26c/Vitale-CNS-HI.png\"},{\"authors\":[],\"id\":1062,\"title\":\"Podman in Action\",\"isbn\":9781633439689,\"description\":\"The next generation of containers is here. Learn Podman directly from its creator, discover its exceptional security features, and start managing rootless containers that integrate easily into your systems.\",\"imageurl\":\"https://images.manning.com/360/480/resize/book/c/6645284-dac7-4a6c-85c9-910988970aa2/Walsh-HI.png\"},{\"authors\":[],\"id\":1063,\"title\":\"Kubernetes Secrets Management\",\"isbn\":9781617298912,\"description\":\"Safely manage your secret information like passwords, keys, and certificates in Kubernetes. This practical guide is full of best practices and methods for adding layers of security that will defend the critical data of your applications.\",\"imageurl\":\"https://images.manning.com/360/480/resize/book/b/5c7e017-d818-49a7-9340-e807e375a69f/Soto-Bueno-HI.png\"},{\"authors\":[],\"id\":1064,\"title\":\"MONGO DB. ПОЛНОЕ РУКОВОДСТВО\",\"isbn\":9785970607923,\"description\":\"В этой книге детально рассматривается обновленная версия MongoDB 4.2 – мощной системы управления базами данных. Вы узнаете о том, как эта безопасная, высокопроизводительная система обеспечивает гибкие модели данных, высокую их доступность и горизонтальную масштабируемость. Авторы представляют руководство для разработчиков баз данных, расширенные настройки для системных администраторов и сценарии использования MongoDB в различных проектах.\\n\",\"imageurl\":\"https://dmkpress.com/images/cms/thumbs/a5b0aeaa3fa7d6e58d75710c18673bd7ec6d5f6d/x978-5-97060-792-3_270_369_jpg__100.jpg.pagespeed.ic.EXI0ohsF2D.webp\"},{\"authors\":[],\"id\":1065,\"title\":\"Java Persistence with Spring Data and Hibernate\",\"isbn\":9781617299186,\"description\":\"Java Persistence with Spring Data and Hibernate teaches you the ins-and-outs of Java persistence with hands-on examples using Spring Data, JPA, and Hibernate. The book carefully analyzes the capabilities of the major Java persistence tools, and guides you through the most common use cases. By comparing and contrasting the alternatives, you’ll find it easy to choose the right tool choice for your applications. You’ll learn how to make and utilize mapping strategies, about the different approach to transactions for both Hibernate and Spring Data, and even how to efficiently test Java persistence applications. The practical techniques are demonstrated with both relational and non-relational databases.\",\"imageurl\":\"https://images.manning.com/360/480/resize/book/e/98a1ae4-fb7c-4357-9852-01dde05c6431/Tudose-HI.png\"},{\"authors\":[],\"id\":1066,\"title\":\"Выразительный JavaScript\",\"isbn\":9785446112265,\"description\":\"«Выразительный JavaScript» позволит глубоко погрузиться в тему, научиться писать красивый и эффективный код. Вы познакомитесь с синтаксисом, стрелочными и асинхронными функциями, итератором, шаблонными строками и блочной областью видимости.\",\"imageurl\":\"https://top-1000.ru/foto/a5d5e8c4bd872679da7e145bfd20ade2.webp\"}]"
    },
    "statusCode": 200
  }
}
